// УВАГА! СТУДЕНТИ, ЯКІ НАВЧАЮТЬСЯ ЗА ЮТУБОМ МЕНТОРА РОМАНА, ІНФОРМАЦІЯ ДЛЯ ВАС! =)
// Вам не потрібно виконувати 6 завдання (із зірочкою). Завдання на try..catch будуть трохи далі =)

// 1. Даний рядок тексту. Вивести його задом наперед

// const str = 'I are baboon';
// let reversedStr = '';

// for (const char of str) {
//     reversedStr = char + reversedStr;
// }
// console.log(reversedStr);



// const str = 'I are baboon';
// const reversedStr = str.split('').reverse().join('');
// console.log(reversedStr);





// 2. Написати функцію, яка приймає число з дрібною частиною і повертає тільки цілу частину

// 3. Прийняти від користувача (за допомогою prompt) його ім’я і вивести його у модальне вікно великими літерами (‘alex’ -> ‘ALEX’)

// 4. Написати функцію, яка приймає рядок тексту з датою у форматі “2021-22-09” і повертає її у вигляді “22.09.2021”

// 5. Написати функцію, яка приймає два рядки, написані у різному регістрі та порівнює їх незалежно від регістру.
// isEqual(‘pApA’, ‘papa’)  //true
// isEqual(‘qwerty’, ‘QWErty’)  //true
// isEqual(‘aaa’, ‘EEE’) //false 

// *6. Написати функцію, яка викидає помилку під час роботи і перевірити роботу функції, викликавши її у блоці try-catch